import React from "react";
import { User } from "../../../types";
interface AddressInfoModallProps {
  setOpenChange: React.Dispatch<React.SetStateAction<boolean>>;
  UserInfo: User;
}
const AddressInfoModall: React.FC<AddressInfoModallProps> = ({
  setOpenChange,
  UserInfo,
}) => {
  return (
    <div>
      <div className="flex flex-col">
        <p className="flex items-center my-2">
          <svg
            width="30px"
            height="30px"
            viewBox="0 0 1024 1024"
            fill="#000000"
            className="icon ml-5"
            version="1.1"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M512 1012.8c-253.6 0-511.2-54.4-511.2-158.4 0-92.8 198.4-131.2 283.2-143.2h3.2c12 0 22.4 8.8 24 20.8 0.8 6.4-0.8 12.8-4.8 17.6-4 4.8-9.6 8.8-16 9.6-176.8 25.6-242.4 72-242.4 96 0 44.8 180.8 110.4 463.2 110.4s463.2-65.6 463.2-110.4c0-24-66.4-70.4-244.8-96-6.4-0.8-12-4-16-9.6-4-4.8-5.6-11.2-4.8-17.6 1.6-12 12-20.8 24-20.8h3.2c85.6 12 285.6 50.4 285.6 143.2 0.8 103.2-256 158.4-509.6 158.4z m-16.8-169.6c-12-11.2-288.8-272.8-288.8-529.6 0-168 136.8-304.8 304.8-304.8S816 145.6 816 313.6c0 249.6-276.8 517.6-288.8 528.8l-16 16-16-15.2zM512 56.8c-141.6 0-256.8 115.2-256.8 256.8 0 200.8 196 416 256.8 477.6 61.6-63.2 257.6-282.4 257.6-477.6C768.8 172.8 653.6 56.8 512 56.8z m0 392.8c-80 0-144.8-64.8-144.8-144.8S432 160 512 160c80 0 144.8 64.8 144.8 144.8 0 80-64.8 144.8-144.8 144.8zM512 208c-53.6 0-96.8 43.2-96.8 96.8S458.4 401.6 512 401.6c53.6 0 96.8-43.2 96.8-96.8S564.8 208 512 208z"
              fill=""
            />
          </svg>
          {UserInfo?.address ? UserInfo?.address?.address : "ادرس وارد نشده"}
        </p>
        <p className="flex items-center my-2">
          <svg
            className="ml-5"
            width="30px"
            height="30px"
            viewBox="0 0 24 24"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              d="M4 18L9 12M20 18L15 12M3 8L10.225 12.8166C10.8665 13.2443 11.1872 13.4582 11.5339 13.5412C11.8403 13.6147 12.1597 13.6147 12.4661 13.5412C12.8128 13.4582 13.1335 13.2443 13.775 12.8166L21 8M6.2 19H17.8C18.9201 19 19.4802 19 19.908 18.782C20.2843 18.5903 20.5903 18.2843 20.782 17.908C21 17.4802 21 16.9201 21 15.8V8.2C21 7.0799 21 6.51984 20.782 6.09202C20.5903 5.71569 20.2843 5.40973 19.908 5.21799C19.4802 5 18.9201 5 17.8 5H6.2C5.0799 5 4.51984 5 4.09202 5.21799C3.71569 5.40973 3.40973 5.71569 3.21799 6.09202C3 6.51984 3 7.07989 3 8.2V15.8C3 16.9201 3 17.4802 3.21799 17.908C3.40973 18.2843 3.71569 18.5903 4.09202 18.782C4.51984 19 5.07989 19 6.2 19Z"
              stroke="#000000"
              strokeWidth="2"
              strokeLinecap="round"
              strokeLinejoin="round"
            />
          </svg>
          {UserInfo?.email ? UserInfo?.email : "ایمیل وارد نشده"}
        </p>
        <p className="flex items-center my-2">
          <svg
            width="30px"
            className="ml-5"
            height="30px"
            viewBox="0 0 24 24"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              fillRule="evenodd"
              clipRule="evenodd"
              d="M8 2C6.34315 2 5 3.34315 5 5V19C5 20.6569 6.34315 22 8 22H16C17.6569 22 19 20.6569 19 19V5C19 3.34315 17.6569 2 16 2H8ZM7 5C7 4.44772 7.44772 4 8 4H16C16.5523 4 17 4.44772 17 5V19C17 19.5523 16.5523 20 16 20H8C7.44772 20 7 19.5523 7 19V5ZM10 17C9.44772 17 9 17.4477 9 18C9 18.5523 9.44772 19 10 19H14C14.5523 19 15 18.5523 15 18C15 17.4477 14.5523 17 14 17H10Z"
              fill="#000000"
            />
          </svg>
          {UserInfo?.phone ? UserInfo?.phone : "شماره مویابل وارد نشده"}
        </p>{" "}
        <p className="flex items-center my-2">
          {/* <FaMailchimp className="ml-5" /> */}
          <svg
            fill="#000000"
            version="1.1"
            id="Capa_1"
            xmlns="http://www.w3.org/2000/svg"
            width="30px"
            height="30px"
            viewBox="0 0 551.297 551.297"
            className={"ml-5"}
          >
            <g>
              <g>
                <polygon points="336.466,551.297 374.716,551.297 374.716,373.168 336.466,384.078 		" />
                <path
                  d="M441.329,120.985h-80.134l-8.902,122.869c0.057,0.698,0.344,11.896-6.561,19.106c-3.538,3.701-8.396,5.651-14.057,5.651
			c-3.165,0-13.903-0.44-19.221-6.13c-2.084-2.228-3.079-4.972-2.888-7.946l8.874-133.55H208.97
			c71.317,15.635,70.14,104.375,70.122,105.302v162.592l2.228,0.994l45.585-13.006l9.562-2.725l38.25-10.91l9.562-2.727
			l114.75-32.742c0-14.734,0-73.583,0-135.653C499.029,125.871,443.681,120.985,441.329,120.985z"
                />
                <path
                  d="M201.568,129.294c-4.982-0.765-9.62-1.1-13.99-1.09c-1.578,0-3.088,0.096-4.581,0.201
			c-1.73,0.115-3.423,0.287-5.039,0.545c-9.869,1.549-17.691,5.508-23.18,12c-14.095,16.648-9.667,44.103-9.62,44.38l0.058,143.772
			l86.225,36.758l12.039,5.135l26.048,11.102v-0.172V226.172c0-0.153,0-0.622,0.01-1.033c0.009-3.911-0.287-19.068-5.317-36.462
			C257.069,164.006,240.401,135.252,201.568,129.294z"
                />
                <path
                  d="M66.852,418.875c0.096,0-32.771,52.174-0.134,84.811c10.06,10.061,23.438,15.156,39.79,15.156
			c30.877,0,63.581-18.312,75.964-30.695c17.557-17.557,70.38-76.174,85.996-93.541l-126.856-56.59L66.852,418.875z"
                />
                <path
                  d="M338.809,256.371c3.48-3.614,4.025-10.366,3.931-12.67l8.874-122.716l0.688-9.562l3.04-42.037l4.639,0.201
			c0.143,0,13.674,0.536,26.048-1.157c8.405-1.147,8.979-7.746,9.008-9.056c0.115-0.966,2.438-13.349,3.596-29.577
			c0.822-11.427-6.904-13.206-8.453-13.455L336.055,0l-7.392,111.422l-0.632,9.562l-8.902,134.19
			c1.77,2.314,6.426,3.863,12.556,3.863C334.736,259.048,337.069,258.168,338.809,256.371z"
                />
              </g>
            </g>
          </svg>
          {UserInfo?.address?.postalCode
            ? UserInfo?.address?.postalCode
            : "کد پستی وارد نشده"}
        </p>{" "}
        <p className="flex items-center my-2">
          <svg
            className={"ml-5"}
            width="20px"
            height="20px"
            viewBox="0 0 24 24"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <circle cx="12" cy="9" r="3" stroke="#1C274C" strokeWidth="1.5" />
            <circle
              cx="12"
              cy="12"
              r="10"
              stroke="#1C274C"
              strokeWidth="1.5"
            />
            <path
              d="M17.9691 20C17.81 17.1085 16.9247 15 11.9999 15C7.07521 15 6.18991 17.1085 6.03076 20"
              stroke="#1C274C"
              strokeWidth="1.5"
              strokeLinecap="round"
            />
          </svg>
          {UserInfo?.firstName ? UserInfo?.firstName : "اسم وارد نشده"}{" "}
          {UserInfo?.lastName}
        </p>
        <div className="flex justify-end">

        <button
          onClick={() => {
            setOpenChange(true);
          }}
          className="text-link border-link flex items-center my-5 border-2 p-2 w-fit justify-end"
        >
          ویرایش
          <svg
            width="20px"
            height="20px"
            viewBox="0 0 24 24"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
            >
            <path
              d="M5 12H19M5 12L11 6M5 12L11 18"
              stroke="#1E8EFF"
              strokeWidth="2"
              strokeLinecap="round"
              strokeLinejoin="round"
            />
          </svg>
        </button>
        </div>
      </div>
    </div>
  );
};

export default AddressInfoModall;
