export const MenuData = [
  {
    id: "menu1",
    icon: (
      <svg
        fill="#6b7280"
        width="15px"
        height="15px"
        viewBox="0 0 32 32"
        version="1.1"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M23.226 2.361c-0.8-0.375-1.556-0.729-2.245-1.075-1.765-0.884-3.364-1.313-4.89-1.313-3.072 0-5.197 1.772-6.53 3.105l-6.464 6.471c-3.459 3.463-4.011 6.988-1.79 11.431 0.345 0.69 0.699 1.448 1.074 2.251 2.022 4.325 4.112 8.796 7.533 8.796 0.096 0 0.191-0.003 0.288-0.011 3.53-0.276 4.532-4.822 5.416-8.831 0.14-0.635 0.274-1.244 0.41-1.79 0.238-0.944 0.705-1.53 1.986-2.814l0.176-0.177 0.108-0.108 0.285-0.284c1.284-1.284 1.87-1.751 2.816-1.989 0.541-0.136 1.148-0.27 1.782-0.409 4.007-0.884 8.55-1.886 8.825-5.423 0.278-3.588-4.327-5.745-8.781-7.83zM29.952 10.010c-0.195 2.493-5.775 3.229-9.097 4.062-1.469 0.371-2.363 1.149-3.712 2.498-0.094 0.094-0.189 0.188-0.284 0.283s-0.189 0.191-0.283 0.284c-1.349 1.351-2.125 2.244-2.495 3.715-0.834 3.325-1.568 8.912-4.058 9.107-0.045 0.003-0.090 0.005-0.135 0.005-2.642 0-4.865-6.008-6.826-9.927-1.992-3.985-1.139-6.569 1.417-9.128 0.49-0.491 1.101-1.101 1.848-1.849 0.763-0.764 1.671-1.673 2.747-2.75 0.747-0.748 1.357-1.357 1.848-1.849 1.588-1.589 3.186-2.52 5.122-2.52 1.181 0 2.489 0.345 3.996 1.102 3.983 1.997 10.122 4.265 9.912 6.968zM14.962 10.977h2v-2h-2v2zM14.962 7.977h2v-2h-2v2zM17.962 7.977h2v-2h-2v2zM17.962 10.977h2v-2h-2v2zM10.309 16.982l0.761-0.761c0.375-0.375 0.375-0.983 0-1.358s-0.982-0.375-1.357 0l-0.761 0.761-0.761-0.761c-0.375-0.375-0.982-0.375-1.357 0s-0.375 0.983 0 1.358l0.761 0.761-0.761 0.761c-0.375 0.375-0.375 0.983 0 1.357s0.983 0.375 1.357 0l0.761-0.761 0.783 0.783c0.375 0.375 0.982 0.375 1.357 0s0.375-0.983 0-1.358z"></path>
      </svg>
    ),
    title: "کنسول بازی",
    items: [
      {
        title: "پلی استیشن",
        options: [
          { label: "پلی استیشن", link: "/products/playstations" },
          { label: "پلی استیشن 5", link: "/products/playstations/playstation-5" },
          { label: "پلی استیشن 4", link: "/products/playstations/playstation-4" },
        ],
      },
      {
        title: "ایکس باکس",
        options: [
          { label: "ایکس باکس سریز", link: "/products/xboxs/xbox-series" },
          { label: "ایکس باکس وان", link: "/products/xboxs/xbox-one" },
        ],
      },
      {
        title: "کنسول‌های کلاسیک",
        options: [
          { label: "پلی استیشن 2", link: "/products/playstations/playstation-2" },
          { label: "سوپر سگا", link: "/products/playstations/super-sega" },
        ],
      },
      {
        title: "کنسول‌های کارکرده",
        options: [
          { label: "پلی استیشن 4", link: "/products/playstations/used-playstation-4" },
          { label: "پلی استیشن 3", link: "/products/playstations/used-playstation-3" },
        ],
      },
    ],
  },
  {
    id: "menu2",
    title: "لوازم جانبی",
    icon: (
      <svg
        width="15px"
        height="15px"
        viewBox="0 0 24 24"
        xmlns="http://www.w3.org/2000/svg"
      >
        <title>amazon</title>
        <rect width="24" height="24" fill="none" />
        <path stroke="#6b7280" d="M15.93,17.09a.54.54,0,0,1-.63.06,6.55,6.55,0,0,1-1.54-1.79,5.31,5.31,0,0,1-4.42,1.95,3.8,3.8,0,0,1-4-4.17A4.55,4.55,0,0,1,8.19,8.76a18.39,18.39,0,0,1,5-.93V7.5a3.42,3.42,0,0,0-.33-2,1.79,1.79,0,0,0-1.5-.7A2,2,0,0,0,9.25,6.45a.6.6,0,0,1-.47.49l-2.6-.28a.47.47,0,0,1-.4-.56C6.38,3,9.23,2,11.78,2a6.1,6.1,0,0,1,4,1.33C17.11,4.55,17,6.18,17,8v4.17a3.6,3.6,0,0,0,1,2.48c.17.25.21.54,0,.71l-2.06,1.78h0m-2.7-6.53V10c-1.94,0-4,.39-4,2.67,0,1.16.61,1.95,1.63,1.95a2.19,2.19,0,0,0,1.86-1.22,5.32,5.32,0,0,0,.5-2.84m6.93,9A14.29,14.29,0,0,1,12.1,22a14.59,14.59,0,0,1-9.85-3.76c-.2-.18,0-.43.25-.29a19.68,19.68,0,0,0,9.83,2.61A19.69,19.69,0,0,0,19.84,19c.37-.16.66.24.32.51m.91-1c-.28-.36-1.85-.17-2.57-.08-.19,0-.22-.16,0-.3A3.92,3.92,0,0,1,22,17.79a3.86,3.86,0,0,1-1.24,3.32c-.18.16-.35.07-.26-.11C20.76,20.33,21.35,18.86,21.07,18.5Z" />
      </svg>
    ),

    items: [
      {
        title: "لوازم پلی استیشن 5",
        options: [
          { label: "کنترلر", link: "/products/accessories/ps5-controller" },
          { label: "هدست", link: "/products/accessories/ps5-headset" },
          { label: "شارژر و استند", link: "/products/accessories/ps5-charger" },
          { label: "کیف و کاور", link: "/products/accessories/ps5-cover" },
        ],
      },
      {
        title: "لوازم پلی استیشن 4",
        options: [
          { label: "کنترلر", link: "/products/accessories/ps4-controller" },
          { label: "هدست", link: "/products/accessories/ps4-headset" },
          { label: "شارژر و استند", link: "/products/accessories/ps4-charger" },
        ],
      },
    ],
  },
  {
    id: "menu3",
    title: "بازی ها",
    icon: (
      <svg
        width="15px"
        height="15px"
        viewBox="0 -0.5 17 17"
        version="1.1"
        xmlns="http://www.w3.org/2000/svg"
        className="si-glyph si-glyph-game-1"
      >
        <defs></defs>
        <g stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
          <path
            d="M8.931,7.986 L13.744,1.643 C12.408,0.617 10.743,-0.000999999989 8.931,-0.000999999989 C4.551,-0.000999999989 1,3.561 1,7.956 C1,12.352 4.551,15.915 8.931,15.915 C12.448,15.915 15.426,13.615 16.464,10.434 L8.931,7.986 L8.931,7.986 Z M7.49947239,5 C6.6732325,5 6,4.3286418 6,3.50105559 C6,2.67241379 6.6732325,2 7.49947239,2 C8.3267675,2 9,2.67241379 9,3.50105559 C9,4.3286418 8.32782272,5 7.49947239,5 L7.49947239,5 Z"
            fill="#6b7280"
            className="si-glyph-fill"
          ></path>
        </g>
      </svg>
    ),

    items: [
      {
        title: "پلی استیشن 5",
        options: [
          { label: "دیسک", link: "/games/ps5/disc" },
          { label: "اکانت بازی های ظرفیتی", link: "/games/ps5/account" },
          { label: "پلی استیشین پلاس", link: "/games/ps5/ps-plus" },
        ],
      },
      {
        title: "پلی استیشن 4",
        options: [
          { label: "دیسک", link: "/games/ps4/disc" },
          { label: "اکانت بازی های ظرفیتی", link: "/games/ps4/account" },
          { label: "پلی استیشین پلاس", link: "/games/ps4/ps-plus" },
        ],
      },
      {
        title: "ایکس باکس",
        options: [
          { label: "بازی‌های قانونی", link: "/games/accountgames" },
          { label: "گیم پس", link: "/games/game-pass" },
        ],
      },
    ],
  },
  {
    id: "menu4",
    title: "لوازم گیمینگ",
    icon: (
      <svg
        width="15px"
        height="15px"
        viewBox="0 0 24 24"
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path
          d="M3 11.3C3 6.32949 7.02944 2.30005 12 2.30005C16.9706 2.30005 21 6.32949 21 11.3M3 11.3H5C6.10457 11.3 7 12.1955 7 13.3V15.3C7 16.4046 6.10457 17.3 5 17.3M3 11.3V16.3C3 16.8523 3.44772 17.3 4 17.3H5M21 11.3H19C17.8954 11.3 17 12.1955 17 13.3V15.3C17 16.4046 17.8954 17.3 19 17.3H20C20.5523 17.3 21 16.8523 21 16.3V11.3ZM5 17.3V18.3C5 19.4046 5.89543 20.3 7 20.3H9M9 20.3C9 21.1285 9.67157 21.8 10.5 21.8H11.5C12.3284 21.8 13 21.1285 13 20.3C13 19.4716 12.3284 18.8 11.5 18.8H10.5C9.67157 18.8 9 19.4716 9 20.3Z"
          stroke="#6b7280"
          strokeWidth="2"
          strokeLinecap="round"
        />
      </svg>
    ),

    items: [
      {
        title: "لوازم جانبی گیمینگ",
        options: [
          { label: "کیبورد", link: "/gaming-accessories/keyboards" },
          { label: "ماوس", link: "/gaming-accessories/mice" },
          { label: "هدست", link: "/gaming-accessories/headsets" },
        ],
      },
    ],
  },
];
